# ParameterValueNotDefined Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..ParameterValueNotDefined Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
Parameter assigned to the dimension has no value defined.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ParameterValueNotDefined { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ParameterValueNotDefined As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ParameterValueNotDefined {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace